Revit 2027 API
PanelScheduleData.PhasesAsCurrents Property
 If true, the phase columns are currents (A), otherwise they are loads (VA); setting this value must go through the appropriate update function
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool PhasesAsCurrents { get; }
Public ReadOnly Property PhasesAsCurrents As Boolean
	Get
public:
property bool PhasesAsCurrents {
	bool get ();
}
member PhasesAsCurrents : bool with get
Property Value
Boolean
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace